# MySQL 연결
:pip install pymysql

In [1]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.10.0-py2.py3-none-any.whl (47 kB)
     |████████████████████████████████| 47 kB 431 kB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-0.10.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pymysql

### useraddress schema에서 userinfo table 불러오기

In [98]:
# MySql Connection
conn = pymysql.connect(host="127.0.0.1", user='root', password='qwer1234', db='useraddress', charset='utf8')

In [99]:
# Connection으로부터 Cursor 생성
curs = conn.cursor()

In [100]:
# SQL 문장
sql = "select * from userinfo"
curs.execute(sql)

9

In [101]:
# Data Fetch
rows = curs.fetchall()
print(rows)

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'))

In [102]:
# Connection 종료
conn.close()

In [103]:
# List로 변환
rowsList = list(rows)
print(rowsList)

[(1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2')]

In [104]:
#필요한 부분 데이터 가져오기
print(rowsList[0])
print(rowsList[0][1])

(1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인')
김승희

### Insert Data #1

In [105]:
# MySql connection
conn = pymysql.connect(host="127.0.0.1", user='root', password='qwer1234', db='useraddress', charset='utf8')

# Connection으로부터 Cursor 생성
curs = conn.cursor()

In [106]:
# SQL 문장
sql = "insert into userinfo(name, telno, address, email, relation) values (%s, %s, %s, %s, %s)"

In [107]:
# insert 실행
curs.execute(sql, ('AAA', '001-0001-0001', 'seoul', 'aaa@naver.com', 'test'))
curs.execute(sql, ('BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'test'))
curs.execute(sql, ('CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'test'))
curs.execute(sql, ('DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'test'))
curs.execute(sql, ('FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'test'))

1

In [108]:
conn.commit()

In [109]:
# Data 보기
sql = "select * from userinfo"
curs.execute(sql)
# Data Fetch
rows = curs.fetchall()
print(rows)

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'), (20, 'AAA', '001-0001-0001', 'seoul', 'aaa@naver.com', 'test'), (21, 'BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'test'), (22, 'CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'test'), (23, 'DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'test'), (24, 'FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'test'))

In [110]:
# Connection 종료
conn.close()

---
### Insert Data #2

In [111]:
# MySql connection
conn = pymysql.connect(host="127.0.0.1", user='root', password='qwer1234', db='useraddress', charset='utf8')

# Connection으로부터 Cursor 생성
curs = conn.cursor()

In [112]:
# Data
data = (
    ('A11', '001-0001-0001', 'seoul', 'a11@naver.com', 'test1'),
    ('B11', '001-0002-0002', 'seoul', 'b11@naver.com', 'test1'),
    ('C11', '001-0003-0003', 'seoul', 'c11@naver.com', 'test1'),
    ('D11', '001-0004-0004', 'seoul', 'd11@naver.com', 'test1'),
    ('F11', '001-0005-0005', 'seoul', 'f11@naver.com', 'test1')  
)

In [114]:
# SQL 문장
sql = "insert into userinfo(name, telno, address, email, relation) values (%s, %s, %s, %s, %s) "

In [115]:
# Insert 실행
curs.executemany(sql, data)

5

In [116]:
conn.commit()

In [117]:
# Data 보기
sql = "select * from userinfo"
curs.execute(sql)
# Data Fetch
rows = curs.fetchall()
print(rows)

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'), (20, 'AAA', '001-0001-0001', 'seoul', 'aaa@naver.com', 'test'), (21, 'BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'test'), (22, 'CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'test'), (23, 'DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'test'), (24, 'FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'test'), (25, 'A11', '001-0001-0001', 'seoul', 'a11@naver.com', 'test1'), (26, 'B11', '001-0002-0002', 'seoul', 'b11@naver.com', 'test1'), (27, 'C11', '001-0003-0003', 'seoul', 'c11@naver.com', 'test1'), (28, 'D11', '001-0004-0004', 'seoul', 'd11@naver.com', 'test1'), (29, 'F11', '001-0005-0005', 'seoul', 'f11@naver.com', 'test1'))

In [118]:
# Connection 종료
conn.close()

----
### Update Data

In [119]:
# MySql connection
conn = pymysql.connect(host="127.0.0.1", user='root', password='qwer1234', db='useraddress', charset='utf8')

# Connection으로부터 Cursor 생성
curs = conn.cursor()

In [120]:
# sql 문장
sql = "update userinfo set relation = 'pdata test용' where relation = 'test'"

In [121]:
curs.execute(sql)

5

In [122]:
conn.commit()

In [123]:
# Data 보기
sql = "select * from userinfo"
curs.execute(sql)
# Data Fetch
rows = curs.fetchall()
print(rows)

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'), (20, 'AAA', '001-0001-0001', 'seoul', 'aaa@naver.com', 'pdata test용'), (21, 'BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'pdata test용'), (22, 'CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'pdata test용'), (23, 'DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'pdata test용'), (24, 'FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'pdata test용'), (25, 'A11', '001-0001-0001', 'seoul', 'a11@naver.com', 'test1'), (26, 'B11', '001-0002-0002', 'seoul', 'b11@naver.com', 'test1'), (27, 'C11', '001-0003-0003', 'seoul', 'c11@naver.com', 'test1'), (28, 'D11', '001-0004-0004', 'seoul', 'd11@naver.com', 'test1'), (29, 'F11', '001-0005-0005', 'seoul', 'f11@naver.com', 'test1'))

In [124]:
# Connection 종료
conn.close()

----
### Delete Data

In [125]:
# MySql Connection
conn = pymysql.connect(host='127.0.0.1', user='root', password ='qwer1234', \
                       db = 'useraddress', charset = 'utf8')
# Connection으로 부터 Cursor 생성
curs = conn.cursor()

In [126]:
# sql 문장

sql = "delete from userinfo where name = %s"

In [127]:
# delete 실행
curs.execute(sql, 'AAA')

1

In [128]:
conn.commit()

In [129]:
# SQL 문장
sql = "select * from userinfo"
curs.execute(sql)
# Data Fetch
rows = curs.fetchall()
print(rows)

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'), (21, 'BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'pdata test용'), (22, 'CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'pdata test용'), (23, 'DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'pdata test용'), (24, 'FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'pdata test용'), (25, 'A11', '001-0001-0001', 'seoul', 'a11@naver.com', 'test1'), (26, 'B11', '001-0002-0002', 'seoul', 'b11@naver.com', 'test1'), (27, 'C11', '001-0003-0003', 'seoul', 'c11@naver.com', 'test1'), (28, 'D11', '001-0004-0004', 'seoul', 'd11@naver.com', 'test1'), (29, 'F11', '001-0005-0005', 'seoul', 'f11@naver.com', 'test1'))

----
### Insert 후 Selete 하기

In [130]:
# MySql connection
conn = pymysql.connect(host="127.0.0.1", user='root', password='qwer1234', db='useraddress', charset='utf8')

In [131]:
try :
    # Insert
    with conn.cursor() as curs :
        sql = "insert into userinfo(name, telno, address, email, relation) values (%s, %s, %s, %s, %s)"
        curs.execute(sql, ('A33', '001-0001-0001', 'seoul', 'a22@naver.com', 'test3'))
    conn.commit()
    
    # Select
    with conn.cursor() as curs :
        sql = "select * from userinfo"
        curs.execute(sql)
        rows = curs.fetchall()
        print(rows)

finally:
    conn.close()

((1, '김승희', '010-1111-2222', '서울시 은평구', 'zzeung@gmail.com', '본인'), (2, '이다겸', '010-2222-3333', '부산시', 'da@gmail.com', '친구'), (3, '정혜윤', '010-3333-4444', '부산시', 'yoon@gmail.com', '친구'), (4, '윤소윤', '010-4444-5555', '부산시', 'so@gamil.com', '친구'), (5, '신수진', '010-5555-6666', '부산시', 'jin@gmail.com', '친구'), (6, '안서현', '010-6666-7777', '서울시', 'seo@gmail.com', '친구'), (7, '문경희', '010-7777-8888', '서울시', 'moon@gmail.com', '친구'), (8, '양선주', '010-8888-9999', '부산시', 'joo@gmail.com', '친구'), (19, 'A22', '001-0001-0001', 'seoul', 'a22@naver.com', 'test2'), (21, 'BBB', '001-0002-0002', 'seoul', 'bbb@naver.com', 'pdata test용'), (22, 'CCC', '001-0003-0003', 'seoul', 'ccc@naver.com', 'pdata test용'), (23, 'DDD', '001-0004-0004', 'seoul', 'ddd@naver.com', 'pdata test용'), (24, 'FFF', '001-0005-0005', 'seoul', 'fff@naver.com', 'pdata test용'), (25, 'A11', '001-0001-0001', 'seoul', 'a11@naver.com', 'test1'), (26, 'B11', '001-0002-0002', 'seoul', 'b11@naver.com', 'test1'), (27, 'C11', '001-0003-0003', 'seoul', 'c11@naver.com', 'test1'), (28, 'D11', '001-0004-0004', 'seoul', 'd11@naver.com', 'test1'), (29, 'F11', '001-0005-0005', 'seoul', 'f11@naver.com', 'test1'), (30, 'A33', '001-0001-0001', 'seoul', 'a22@naver.com', 'test3'))

----
### select의 내용을 dataframe으로 보기

In [73]:
#pip install sqlalchemy
from sqlalchemy import create_engine
import pandas as pd

In [78]:
engine = create_engine("mysql+pymysql://root:" + "qwer1234" + "@127.0.0.1:3306/useraddress?", convert_unicode = True)
conn = engine.connect()

In [79]:
data = pd.read_sql_table("userinfo", conn)
data

   seqno name          telno  address             email relation
0      1  김승희  010-1111-2222  서울시 은평구  zzeung@gmail.com       본인
1      2  이다겸  010-2222-3333      부산시      da@gmail.com       친구
2      3  정혜윤  010-3333-4444      부산시    yoon@gmail.com       친구
3      4  윤소윤  010-4444-5555      부산시      so@gamil.com       친구
4      5  신수진  010-5555-6666      부산시     jin@gmail.com       친구
5      6  안서현  010-6666-7777      서울시     seo@gmail.com       친구
6      7  문경희  010-7777-8888      서울시    moon@gmail.com       친구
7      8  양선주  010-8888-9999      부산시     joo@gmail.com       친구
8     19  A22  001-0001-0001    seoul     a22@naver.com    test2

In [80]:
conn.close()

### dataframe을 Database로 Insert하기

In [77]:
column = ['index', 'title']
movies = pd.read_csv("../Data/DaumList_2020_08_18.csv")
movies.columns = column
movies.head()

   index        title
0      1  다만 악에서 구하소서
1      2       오케이 마담
2      3   강철비2: 정상회담
3      4          인셉션
4      5           반도

In [85]:
engine = create_engine("mysql+pymysql://root:" + "qwer1234" + "@127.0.0.1:3306/useraddress?", convert_unicode = True)
conn = engine.connect()

In [86]:
movies.to_sql(name='daumlist', con=engine, if_exists='append', index=False)

### Rotten 해보기

In [95]:
column = ['index', 'title', 'year']
movies = pd.read_csv("../Data/RottenList_2019.csv")
movies.columns = column
movies.head()

   index                    title  year
0      1  Parasite (Gisaengchung)  2019
1      2        Avengers: Endgame  2019
2      3               Knives Out  2019
3      4                       Us  2019
4      5              Toy Story 4  2019

In [96]:
engine = create_engine("mysql+pymysql://root:" + "qwer1234" + "@127.0.0.1:3306/movies?", convert_unicode = True)
conn = engine.connect()

In [97]:
movies.to_sql(name='rottenlist', con=engine, if_exists='append', index=False)